---
kind: other
id: Properties.T:Autodesk.Revit.DB.SketchEditScope
source: html/e80358f6-6a3c-7d5e-93c1-547705622b16.htm
---
# SketchEditScope Properties

Tells if the EditScope is active. In other words, the EditScope has started but not committed/canceled yet.